---
kind: property
id: P:Autodesk.Revit.DB.InternalOrigin.Position
source: html/a31517d1-9456-1c63-c30c-98b2bf423d58.htm
---
# Autodesk.Revit.DB.InternalOrigin.Position Property

The position of the InternalOrigin.

## Syntax (C#)
```csharp
public XYZ Position { get; }
```